---
kind: other
id: Methods.T:Autodesk.Revit.DB.DirectShapeLibrary
source: html/d91baff1-ab1b-e978-84f9-f00c1981e681.htm
---
# DirectShapeLibrary Methods

Add a definition to be reused by instances. A definition is a single geometry object.